app/controllers/posts_controller.rb

	def index
		@post = Post.all.order('created_at desc').paginate(page: params[:page], per_page: 2)
---
SELECT  "posts".* FROM "posts" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

	def create
		@post = Post.new post_params

		if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)

	def update
		if @post.update post_params
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "hek"], ["updated_at", "2018-04-08 19:17:38.880635"], ["id", 2]]

	def find_post
		@post = Post.friendly.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]