app/controllers/projects_controller.rb

	def index
		@projects = Project.all.order("created_at desc")
---
SELECT "projects".* FROM "projects" ORDER BY created_at desc

	def create
		@project = Project.new project_params
		if @project.save
---
INSERT INTO "projects" ("title", "description", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

	def update
		if @project.update project_params
---
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?

	def find_project
		@project = Project.friendly.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]